src/InformationRegisters/Сканирования/Сканирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сканирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Сканирования/ManagerModule.bsl
Процедура ЗарегистрироватьВводШтрихкода(Штрихкод, Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;		
	КонецЕсли;
	
	МенЗаписи = РегистрыСведений.Сканирования.СоздатьМенеджерЗаписи();
	МенЗаписи.Период = ТекущаяДата();
	МенЗаписи.Пользователь = Пользователь;
	МенЗаписи.Штрихкод = Штрихкод;
	
	МенЗаписи.Записать(Истина);
КонецПроцедуры
